<a href="https://colab.research.google.com/github/bofori-tech/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Copy_of_Bright_Build.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
https://www.kaggle.com/rezag7/homeless-dataset/download

In [ ]:
import pandas as pd

In [ ]:
hless=pd.read_csv('datasets_389627_752018_homeless_prep.csv')
hless.head()

   CLIENT_KEY  AGE  GENDER  ... probation  assistancetype  required
0      256172   20  Female  ...         1  tempassistance         1
1      221079   20  Female  ...         0  tempassistance         1
2      243074   21  Female  ...         0  tempassistance         1
3      129974   21  Female  ...         0  tempassistance         1
4      226596   22  Female  ...         0  tempassistance         1

[5 rows x 11 columns]

In [ ]:
hless.columns

Index(['CLIENT_KEY', 'AGE', 'GENDER', 'VETERAN', 'INCOME', 'NIGHTS',
       'substanceabuse', 'completed', 'probation', 'assistancetype',
       'required'],
      dtype='object')

In [ ]:
!wget https://www.kaggle.com/adamschroeder/homelessness/download

In [ ]:
hmnusa=pd.read_csv('2007-2016-Homelessnewss-USA.csv')
print(hmness.shape)
hmnusa.head()

(86529, 6)

       Year State  ...                                    Measures Count
0  1/1/2007    AK  ...            Chronically Homeless Individuals   224
1  1/1/2007    AK  ...                        Homeless Individuals   696
2  1/1/2007    AK  ...                 Homeless People in Families   278
3  1/1/2007    AK  ...  Sheltered Chronically Homeless Individuals   187
4  1/1/2007    AK  ...                          Sheltered Homeless   842

[5 rows x 6 columns]

In [ ]:
hmnusa.columns

Index(['Year', 'State', 'CoC Number', 'CoC Name', 'Measures', 'Count'], dtype='object')

In [ ]:
pop=pd.read_csv('Population-by-state.csv')
print(pop.shape)
pop.head()

(53, 12)

        GEO.id  ...                                respop72016
0           Id  ...  Population Estimate (as of July 1) - 2016
1  0400000US01  ...                                    4863300
2  0400000US02  ...                                     741894
3  0400000US04  ...                                    6931071
4  0400000US05  ...                                    2988248

[5 rows x 12 columns]

In [ ]:
pop.columns

Index(['GEO.id', 'GEO.id2', 'GEO.display-label', 'rescen42010', 'resbase42010',
       'respop72010', 'respop72011', 'respop72012', 'respop72013',
       'respop72014', 'respop72015', 'respop72016'],
      dtype='object')